Revit 2026 API

# UIControlledApplicationCreateRibbonPanel(Tab, String) Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual RibbonPanel CreateRibbonPanel(
	Tab tab,
	string panelName
)
```
```vb
Public Overridable Function CreateRibbonPanel (
	tab As Tab,
	panelName As String
) As RibbonPanel
```
```cpp
public:
virtual RibbonPanel^ CreateRibbonPanel(
	Tab tab,
	String^ panelName
)
```
```fsharp
abstract CreateRibbonPanel :
        tab : Tab *
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        tab : Tab *
        panelName : string -> RibbonPanel
```

#### Parameters

tab Tab

panelName String

#### Return Value

RibbonPanel

#### Reference

UIControlledApplication Class

CreateRibbonPanel Overload

Autodesk.Revit.UI Namespace